      ***CP008***
           05 受験日            PIC 9(8).
           05 試験結果基本.
              10 受験者ID       PIC X(6).
              10 午前           PIC 9(4).
              10 午後1          PIC 9(4).
              10 午後2          PIC 9(4).
              10 論述           PIC 9(4).
              10 平均点         PIC 9(4).
