      ***CP003***
           05 従業員コード    PIC X(5).
           05 FILLER          PIC X(2).
           05 所属コード      PIC X(3).
           05 FILLER          PIC X(2).
           05 氏名            PIC X(20).
           05 FILLER          PIC X(2).
           05 年齢            PIC X(3).
