      ***CP006A*2023-10-21***
           05 従業員コード    PIC X(5).
           05 カンマＡ        PIC X(1).
           05 所属コード      PIC X(3).
           05 カンマＢ        PIC X(1).
           05 氏名            PIC X(20).
           05 カンマＣ        PIC X(1).
           05 年齢            PIC 9(3).
           05 カンマＤ        PIC X(1).
           05 性別            PIC X(1).
