      ***CP006***
           05 状態.
             10 西暦状態      PIC X(02).
             10 和暦状態      PIC X(02).
           05 終了ステータス  PIC X(01).
           05 読み込み件数    PIC 9(02)
           05 閏年コード      PIC X(01).
