      ***CP002***
           05 FILLER          PIC X(02) VALUE ALL "*".
           05 FILLER          PIC X(33)
                              VALUE "人事ファイルの人事結果".
           05 FILLER          PIC X(02) VALUE ALL "*".
