      ***CP006*2023-10-19***
           05 従業員コード    PIC X(5).
           05 所属コード      PIC X(3).
           05 氏名            PIC X(20).
           05 年齢            PIC 9(3).
           05 性別            PIC X(1).
