      ***CP005***
       01  和暦レコード.
           05 和暦年月日.
              10 和暦         PIC X(01).
              10 和暦年       PIC X(02).
              10 和暦月       PIC X(02).
              10 和暦日       PIC X(02).
