      ***CP004***
       01  西暦レコード.
           05 西暦年月日.
             10 西暦年        PIC 9(04).
             10 西暦月        PIC 9(02).
             10 西暦日        PIC 9(02).
