      ***CP001***
       01  人事レコード.
           05 従業員コード    PIC X(05).
           05 所属コード      PIC X(03).
           05 氏名            PIC X(20).
           05 年齢            PIC 9(03).
